Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.Alignments
Alignment options for the hatch line.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.Alignments.Center
Specifies that the hatch line is center aligned.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.Alignments.LeftEdge
Specifies that the hatch line is left edge aligned.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.Alignments.RightEdge
Specifies that the hatch line is right edge aligned.